WcfHarness/WcfHarness/RequestXmls/GenerateOTP_By_UserIdentifier_BasedRq.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GenerateOTP xmlns="http://www.tavisca.com/Vexiere/IIdentity/2013/01">
      <forgotPasswordRequest i:type="a:UserIdentifierBasedGenerateOTPRQ" xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:UserIdentifier i:type="a:IdBasedUserIdentifier">
          <a:Id>1</a:Id>
        </a:UserIdentifier>
      </forgotPasswordRequest>
    </GenerateOTP>
  </s:Body>
</s:Envelope>
